'''
6. Реализовать два небольших скрипта:
а) итератор, генерирующий целые числа, начиная с указанного,
б) итератор, повторяющий элементы некоторого списка, определенного заранее.
Подсказка: использовать функцию count() и cycle() модуля itertools.
Обратите внимание, что создаваемый цикл не должен быть бесконечным.
Необходимо предусмотреть условие его завершения.
Например, в первом задании выводим целые числа, начиная с 3,
 а при достижении числа 10 завершаем цикл.
 Во втором также необходимо предусмотреть условие,
  при котором повторение элементов списка будет прекращено.
'''

from itertools import count

print('(а) итератор, генерирующий целые числа, начиная с указанного')
for el in count(int(input('Введите стартовое число :'))):
    if el%2==0:
        print(el)
    if el > 10:
        break

print('б) итератор, повторяющий элементы списка')
from itertools import cycle
my_list = [12, True, 'ABC']

stop_cycle = 0
i = None
i = int(input('Задайте кол-во итераций : ')) # можно задать
for el in cycle(my_list):
    print(el)
    stop_cycle += 1
    if stop_cycle == 10 or stop_cycle == i:
        break

